/*******************************************************************************
 * Size: 7 px
 * Bpp: 1
 * Opts: 
 ******************************************************************************/

#ifdef LV_LVGL_H_INCLUDE_SIMPLE
#include "lvgl.h"
#else
#include "lvgl/lvgl.h"
#endif

#ifndef LV_FONT_UNSCII_7_THIN
#define LV_FONT_UNSCII_7_THIN 1
#endif

#if LV_FONT_UNSCII_7_THIN

/*-----------------
 *    BITMAPS
 *----------------*/

/*Store the image of the glyphs*/
static LV_ATTRIBUTE_LARGE_CONST const uint8_t glyph_bitmap[] = {
    /* U+0020 " " */
    0x0,

    /* U+0021 "!" */
    0xc8,

    /* U+0022 "\"" */
    0x99,

    /* U+0023 "#" */
    0x49, 0x2f, 0xff, 0x49, 0x20,

    /* U+0024 "$" */
    0x27, 0xa7, 0xe2,

    /* U+0025 "%" */
    0xc8, 0x88, 0xb9, 0x80,

    /* U+0026 "&" */
    0x62, 0x40, 0x1d, 0x89, 0xd0,

    /* U+0027 "'" */
    0x58,

    /* U+0028 "(" */
    0x2a, 0x44, 0x40,

    /* U+0029 ")" */
    0x88, 0x95, 0x0,

    /* U+002A "*" */
    0x25, 0x5c, 0xea, 0x90,

    /* U+002B "+" */
    0x27, 0xc8, 0x40,

    /* U+002C "," */
    0x60,

    /* U+002D "-" */
    0xf0,

    /* U+002E "." */
    0x80,

    /* U+002F "/" */
    0x4, 0x21, 0xc, 0x42, 0x0,

    /* U+0030 "0" */
    0x69, 0xbd, 0x96,

    /* U+0031 "1" */
    0x23, 0x28, 0x42, 0x7c,

    /* U+0032 "2" */
    0x74, 0x44, 0xe8, 0x7c,

    /* U+0033 "3" */
    0x74, 0x44, 0x68, 0xb8,

    /* U+0034 "4" */
    0x11, 0xb5, 0xf1, 0x8,

    /* U+0035 "5" */
    0xfc, 0x3c, 0x18, 0xb8,

    /* U+0036 "6" */
    0x34, 0x8e, 0x16,

    /* U+0037 "7" */
    0xf8, 0x44, 0x44, 0x20,

    /* U+0038 "8" */
    0x69, 0x6, 0x96,

    /* U+0039 "9" */
    0x6a, 0x97, 0x2c,

    /* U+003A ":" */
    0xa0,

    /* U+003B ";" */
    0x41, 0x80,

    /* U+003C "<" */
    0x25, 0x62, 0x40,

    /* U+003D "=" */
    0xf0, 0xf0,

    /* U+003E ">" */
    0x89, 0x35, 0x0,

    /* U+003F "?" */
    0x7a, 0x10, 0x84, 0x0, 0x40,

    /* U+0040 "@" */
    0x74, 0x6f, 0x68, 0x38,

    /* U+0041 "A" */
    0x22, 0xa3, 0xf8, 0xc4,

    /* U+0042 "B" */
    0xf4, 0x61, 0xe8, 0xf8,

    /* U+0043 "C" */
    0x7c, 0x61, 0x8, 0xbc,

    /* U+0044 "D" */
    0xe4, 0xa3, 0x19, 0x70,

    /* U+0045 "E" */
    0xfc, 0x21, 0xe8, 0x7c,

    /* U+0046 "F" */
    0xfc, 0x3d, 0x8, 0x40,

    /* U+0047 "G" */
    0x74, 0x61, 0x78, 0xb8,

    /* U+0048 "H" */
    0x8c, 0x63, 0xf8, 0xc4,

    /* U+0049 "I" */
    0xe9, 0x25, 0xc0,

    /* U+004A "J" */
    0x8, 0x42, 0x18, 0xb8,

    /* U+004B "K" */
    0x8c, 0x65, 0xe8, 0xc4,

    /* U+004C "L" */
    0x84, 0x21, 0x8, 0x7c,

    /* U+004D "M" */
    0x8e, 0xeb, 0x18, 0xc4,

    /* U+004E "N" */
    0x8e, 0x6b, 0x38, 0xc4,

    /* U+004F "O" */
    0x74, 0x63, 0x18, 0xb8,

    /* U+0050 "P" */
    0xf4, 0x7d, 0x8, 0x40,

    /* U+0051 "Q" */
    0x74, 0xa3, 0x59, 0x34,

    /* U+0052 "R" */
    0xf4, 0x61, 0xeb, 0x44,

    /* U+0053 "S" */
    0x74, 0x40, 0xe8, 0xb8,

    /* U+0054 "T" */
    0xf9, 0x8, 0x42, 0x10,

    /* U+0055 "U" */
    0x8c, 0x63, 0x18, 0xb8,

    /* U+0056 "V" */
    0x8c, 0x63, 0x15, 0x10,

    /* U+0057 "W" */
    0x8c, 0x63, 0x5d, 0xc4,

    /* U+0058 "X" */
    0x88, 0x94, 0xe0, 0x44,

    /* U+0059 "Y" */
    0x8c, 0x5c, 0x42, 0x10,

    /* U+005A "Z" */
    0xf8, 0x44, 0xc8, 0x7c,

    /* U+005B "[" */
    0xf2, 0x49, 0xc0,

    /* U+005C "\\" */
    0x81, 0x2, 0x4, 0x8, 0x10,

    /* U+005D "]" */
    0xe4, 0x93, 0xc0,

    /* U+005E "^" */
    0x26, 0x90,

    /* U+005F "_" */
    0xf0,

    /* U+0060 "`" */
    0x94,

    /* U+0061 "a" */
    0xef, 0x9f,

    /* U+0062 "b" */
    0x88, 0xe9, 0x9e,

    /* U+0063 "c" */
    0x74, 0x62, 0xe0,

    /* U+0064 "d" */
    0x11, 0x79, 0x97,

    /* U+0065 "e" */
    0x7f, 0xe0, 0xe0,

    /* U+0066 "f" */
    0x18, 0x92, 0x3e, 0x20, 0x80,

    /* U+0067 "g" */
    0x79, 0x71, 0x60,

    /* U+0068 "h" */
    0x88, 0xea, 0x99,

    /* U+0069 "i" */
    0x43, 0x25, 0xc0,

    /* U+006A "j" */
    0x10, 0x31, 0x19, 0x60,

    /* U+006B "k" */
    0x84, 0x23, 0xe9, 0x44,

    /* U+006C "l" */
    0xc9, 0x25, 0xc0,

    /* U+006D "m" */
    0xd5, 0x6a, 0x10,

    /* U+006E "n" */
    0xea, 0x99,

    /* U+006F "o" */
    0x69, 0x96,

    /* U+0070 "p" */
    0xe9, 0xe8, 0x80,

    /* U+0071 "q" */
    0x79, 0x71, 0x10,

    /* U+0072 "r" */
    0xbe, 0x21, 0x0,

    /* U+0073 "s" */
    0x7e, 0x1e,

    /* U+0074 "t" */
    0x42, 0x3c, 0x84, 0x98,

    /* U+0075 "u" */
    0x99, 0x6,

    /* U+0076 "v" */
    0x99, 0x64,

    /* U+0077 "w" */
    0x8d, 0x48, 0xa0,

    /* U+0078 "x" */
    0x96, 0x69,

    /* U+0079 "y" */
    0x99, 0x71, 0x60,

    /* U+007A "z" */
    0xf2, 0x4f,

    /* U+007B "{" */
    0x34, 0x88, 0x43,

    /* U+007C "|" */
    0xfe,

    /* U+007D "}" */
    0xc2, 0x21, 0x2c,

    /* U+007E "~" */
    0x4b, 0x20,

    /* U+007F "" */
    0xc2, 0xfa, 0xb2, 0x8, 0x20,

    /* U+0080 "" */
    0xe1, 0x43, 0xbd, 0x54, 0xa1, 0xc0,

    /* U+0081 "" */
    0xc3, 0xc, 0xb6, 0xc8, 0x70,

    /* U+0082 "" */
    0xe1, 0x43, 0xfd, 0x14, 0xc1, 0xc0,

    /* U+0083 "" */
    0xe2, 0x8f, 0xe9, 0x4c, 0x70,

    /* U+0084 "" */
    0xe0, 0x81, 0x3f, 0x50, 0xa1, 0x40,

    /* U+0085 "" */
    0xe1, 0x52, 0xa5, 0x4a, 0x81, 0xc0,

    /* U+0086 "" */
    0xe1, 0x3, 0xb9, 0x4c, 0x63, 0xc0,

    /* U+0087 "" */
    0xe1, 0x3, 0x3c, 0x44, 0x63, 0xc0,

    /* U+0088 "" */
    0xa1, 0x43, 0xbd, 0x40, 0x63, 0xc0,

    /* U+0089 "" */
    0xa1, 0x47, 0x8d, 0x1a, 0xa1, 0xc0,

    /* U+008A "" */
    0xf1, 0xe3, 0xc7, 0xff, 0xed, 0xc3, 0x80,

    /* U+008B "" */
    0xe3, 0xae, 0xe3, 0xc, 0x30, 0x80,

    /* U+008C "" */
    0xe1, 0x57, 0xac, 0x58, 0xa1, 0xc0,

    /* U+008D "" */
    0xc3, 0x8f, 0xfe, 0xaa, 0xa1, 0xc0,

    /* U+008E "" */
    0xe1, 0x3, 0xf9, 0x1c, 0xc1, 0xc0,

    /* U+008F "" */
    0xe2, 0xf, 0xc9, 0xc4, 0x70,

    /* U+0090 "" */
    0xc1, 0xc2, 0x85, 0x7e, 0x99, 0x3, 0x80,

    /* U+0091 "" */
    0xc3, 0xc, 0xa6, 0x8, 0x70,

    /* U+0092 "" */
    0xe1, 0x43, 0xfc, 0x10, 0xc1, 0xc0,

    /* U+0093 "" */
    0xe1, 0x3, 0xb9, 0x4c, 0x81, 0xc0,

    /* U+0094 "" */
    0xe1, 0x2, 0x3c, 0x44, 0x81, 0xc0,

    /* U+0095 "" */
    0xa3, 0xba, 0xeb, 0xc, 0x30,

    /* U+0096 "" */
    0xe1, 0x1, 0xbf, 0x70, 0x81, 0x0,

    /* U+0097 "" */
    0xe1, 0x2, 0x3f, 0x70, 0x81, 0x0,

    /* U+0098 "" */
    0xe2, 0x8e, 0xcb, 0xcc, 0x30,

    /* U+0099 "" */
    0xe2, 0x8e, 0xcb, 0xc4, 0x70,

    /* U+009A "" */
    0xe2, 0x86, 0xfb, 0xc, 0x30,

    /* U+009B "" */
    0xe1, 0x2, 0x3c, 0x44, 0x63, 0xc0,

    /* U+009C "" */
    0xe2, 0xf, 0xfa, 0x8, 0x20,

    /* U+009D "" */
    0xe1, 0x42, 0xbd, 0x44, 0x63, 0xc0,

    /* U+009E "" */
    0xe2, 0x8e, 0xe3, 0xc, 0x30, 0xc0,

    /* U+009F "" */
    0xe1, 0x43, 0xbd, 0x70, 0x81, 0x0,

    /* U+00A0 " " */
    0x0,

    /* U+00A1 "¡" */
    0xcf, 0xf0,

    /* U+00A2 "¢" */
    0x31, 0xff, 0x1f, 0x30,

    /* U+00A3 "£" */
    0x38, 0xd9, 0x87, 0x86, 0x7f, 0x80,

    /* U+00A4 "¤" */
    0xdf, 0xdd, 0xb0,

    /* U+00A5 "¥" */
    0xc3, 0x66, 0x18, 0x3c, 0x18, 0x18,

    /* U+00A6 "¦" */
    0xf0, 0xf0,

    /* U+00A7 "§" */
    0x76, 0x1d, 0xb7, 0xd, 0xc0,

    /* U+00A8 "¨" */
    0xa0,

    /* U+00A9 "©" */
    0x7d, 0x6, 0x6d, 0x99, 0xb0, 0x5f, 0x0,

    /* U+00AA "ª" */
    0xf7, 0xc0, 0xf, 0x80,

    /* U+00AB "«" */
    0x37, 0xf9, 0xb1, 0xb0,

    /* U+00AC "¬" */
    0xfc, 0x30, 0xc0,

    /* U+00AD "­" */
    0xe0,

    /* U+00AE "®" */
    0x7d, 0x6, 0xcd, 0x5b, 0xb0, 0x5f, 0x0,

    /* U+00AF "¯" */
    0xf8,

    /* U+00B0 "°" */
    0x76, 0xdc,

    /* U+00B1 "±" */
    0x30, 0xcf, 0xcc, 0x3, 0xf0,

    /* U+00B2 "²" */
    0x76, 0xcf,

    /* U+00B3 "³" */
    0x72, 0x3e,

    /* U+00B4 "´" */
    0x6b, 0x0,

    /* U+00B5 "µ" */
    0x6d, 0xb7, 0x98, 0xc0,

    /* U+00B6 "¶" */
    0x7d, 0xdf, 0x5d, 0x34, 0xd3, 0x40,

    /* U+00B7 "·" */
    0x80,

    /* U+00B8 "¸" */
    0x70,

    /* U+00B9 "¹" */
    0xed, 0xb0,

    /* U+00BA "º" */
    0xff, 0x0, 0xf0,

    /* U+00BB "»" */
    0xd8, 0xfd, 0xb6, 0xc0,

    /* U+00BC "¼" */
    0x41, 0x9d, 0x72, 0xf7, 0xfb, 0xc1, 0x80,

    /* U+00BD "½" */
    0x41, 0x99, 0x62, 0xa6, 0xfb, 0x7, 0x80,

    /* U+00BE "¾" */
    0xc0, 0x4d, 0xb1, 0xde, 0xf9, 0xc0, 0x80,

    /* U+00BF "¿" */
    0x30, 0x3, 0x18, 0xcd, 0xe0,

    /* U+00C0 "À" */
    0xe0, 0x1d, 0xf8, 0x84,

    /* U+00C1 "Á" */
    0x38, 0x1d, 0xf8, 0x84,

    /* U+00C2 "Â" */
    0x21, 0x40, 0x1e, 0xfe, 0x10,

    /* U+00C3 "Ã" */
    0x63, 0x38, 0x1, 0xe7, 0xe8, 0x40,

    /* U+00C4 "Ä" */
    0x50, 0x1d, 0xf8, 0x84,

    /* U+00C5 "Å" */
    0x30, 0x0, 0x1e, 0xff, 0x30,

    /* U+00C6 "Æ" */
    0x3e, 0xf3, 0x67, 0xed, 0x9b, 0xc0,

    /* U+00C7 "Ç" */
    0x7c, 0x61, 0x8, 0xbc, 0xc0,

    /* U+00C8 "È" */
    0x70, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+00C9 "É" */
    0x1c, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+00CA "Ê" */
    0x10, 0xc0, 0x3f, 0xf3, 0xf0,

    /* U+00CB "Ë" */
    0x28, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+00CC "Ì" */
    0xe0, 0x72, 0x27,

    /* U+00CD "Í" */
    0x38, 0x38, 0x84, 0x70,

    /* U+00CE "Î" */
    0x54, 0x75, 0xc0,

    /* U+00CF "Ï" */
    0x90, 0xe4, 0x4e,

    /* U+00D0 "Ð" */
    0x78, 0xd9, 0x9f, 0xb6, 0xcf, 0x0,

    /* U+00D1 "Ñ" */
    0x66, 0x60, 0x1a, 0x58, 0x20,

    /* U+00D2 "Ò" */
    0xe0, 0x1d, 0x18, 0xb8,

    /* U+00D3 "Ó" */
    0x38, 0x1d, 0x18, 0xb8,

    /* U+00D4 "Ô" */
    0x23, 0x0, 0xe8, 0xb8,

    /* U+00D5 "Õ" */
    0x66, 0x60, 0xe, 0x44, 0xe0,

    /* U+00D6 "Ö" */
    0x50, 0x1d, 0x18, 0xb8,

    /* U+00D7 "×" */
    0xcd, 0xe7, 0xb3,

    /* U+00D8 "Ø" */
    0x7e, 0xff, 0xfd, 0xf8,

    /* U+00D9 "Ù" */
    0x60, 0x8, 0x61, 0x1, 0xe0,

    /* U+00DA "Ú" */
    0x1c, 0x8, 0x61, 0x1, 0xe0,

    /* U+00DB "Û" */
    0x20, 0xc0, 0x21, 0x85, 0xe0,

    /* U+00DC "Ü" */
    0x28, 0x8, 0x61, 0x1, 0xe0,

    /* U+00DD "Ý" */
    0x1c, 0x8, 0x9c, 0x20, 0x80,

    /* U+00DE "Þ" */
    0xc3, 0xf, 0xff, 0xc3, 0x0,

    /* U+00DF "ß" */
    0x76, 0xf5, 0xed, 0xf8,

    /* U+00E0 "à" */
    0xc0, 0xef, 0x9f,

    /* U+00E1 "á" */
    0x38, 0x39, 0xe9, 0x78,

    /* U+00E2 "â" */
    0x21, 0x40, 0x1f, 0x85, 0xf0,

    /* U+00E3 "ã" */
    0x46, 0xe0, 0x1f, 0x85, 0xf0,

    /* U+00E4 "ä" */
    0x90, 0xef, 0x9f,

    /* U+00E5 "å" */
    0x18, 0x0, 0x3, 0xf8, 0x2f, 0xc0,

    /* U+00E6 "æ" */
    0x7e, 0xff, 0x43, 0xf0,

    /* U+00E7 "ç" */
    0x79, 0x97, 0x30,

    /* U+00E8 "è" */
    0xe0, 0x1f, 0xf8, 0x38,

    /* U+00E9 "é" */
    0x18, 0x1f, 0xf8, 0x38,

    /* U+00EA "ê" */
    0x22, 0x9c, 0xf8, 0x38,

    /* U+00EB "ë" */
    0x48, 0x1f, 0xf8, 0x38,

    /* U+00EC "ì" */
    0xe0, 0x62, 0x27,

    /* U+00ED "í" */
    0x38, 0x30, 0x84, 0x70,

    /* U+00EE "î" */
    0x54, 0x65, 0xc0,

    /* U+00EF "ï" */
    0x90, 0xc4, 0x4e,

    /* U+00F0 "ð" */
    0x18, 0xf1, 0x9e, 0xd9, 0xc0,

    /* U+00F1 "ñ" */
    0x66, 0x60, 0x1e, 0x45, 0x10,

    /* U+00F2 "ò" */
    0xe0, 0x1d, 0xbd, 0xb8,

    /* U+00F3 "ó" */
    0x38, 0x1d, 0xbd, 0xb8,

    /* U+00F4 "ô" */
    0x23, 0x0, 0xed, 0xb8,

    /* U+00F5 "õ" */
    0x66, 0x60, 0xe, 0x6c, 0xe0,

    /* U+00F6 "ö" */
    0x50, 0x1d, 0xbd, 0xb8,

    /* U+00F7 "÷" */
    0x30, 0x0, 0x3f, 0x0, 0xc0,

    /* U+00F8 "ø" */
    0x5, 0xed, 0xfb, 0x7a, 0x0,

    /* U+00F9 "ù" */
    0xc0, 0x99, 0x6,

    /* U+00FA "ú" */
    0x38, 0x25, 0x20, 0x30,

    /* U+00FB "û" */
    0x46, 0x9, 0x96,

    /* U+00FC "ü" */
    0x50, 0x99, 0x6,

    /* U+00FD "ý" */
    0x38, 0x25, 0x27, 0x9, 0x80,

    /* U+00FE "þ" */
    0xc6, 0x3d, 0xbf, 0x63, 0x0,

    /* U+00FF "ÿ" */
    0x50, 0x99, 0x71, 0x60,

    /* U+0100 "Ā" */
    0xf8, 0x1d, 0xf8, 0x84,

    /* U+0101 "ā" */
    0xf8, 0x39, 0xe9, 0x78,

    /* U+0102 "Ă" */
    0x82, 0xf8, 0x1, 0xe7, 0xe8, 0x40,

    /* U+0103 "ă" */
    0x85, 0xe0, 0x1f, 0x85, 0xf0,

    /* U+0104 "Ą" */
    0x22, 0xa3, 0xf8, 0xc4, 0xe0,

    /* U+0105 "ą" */
    0xe0, 0xbd, 0xe3, 0x80,

    /* U+0106 "Ć" */
    0xc, 0x7, 0xe0, 0x81, 0xf0,

    /* U+0107 "ć" */
    0x18, 0x1d, 0x18, 0xb8,

    /* U+0108 "Ĉ" */
    0x10, 0xa0, 0x1f, 0x81, 0xf0,

    /* U+0109 "ĉ" */
    0x22, 0x80, 0xf8, 0x3c,

    /* U+010A "Ċ" */
    0x18, 0x7, 0xe0, 0x81, 0xf0,

    /* U+010B "ċ" */
    0x30, 0x1d, 0x18, 0xb8,

    /* U+010C "Č" */
    0x28, 0x40, 0x1f, 0x81, 0xf0,

    /* U+010D "č" */
    0x51, 0x0, 0xf8, 0x3c,

    /* U+010E "Ď" */
    0x61, 0x1, 0xed, 0xf8,

    /* U+010F "ď" */
    0x14, 0x47, 0x34, 0xd1, 0xc0,

    /* U+0110 "Đ" */
    0x78, 0xd9, 0x9f, 0xb6, 0xcf, 0x0,

    /* U+0111 "đ" */
    0x18, 0xf1, 0x9e, 0xd9, 0xe0,

    /* U+0112 "Ē" */
    0x7c, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+0113 "ē" */
    0xf8, 0x1f, 0xf8, 0x38,

    /* U+0114 "Ĕ" */
    0x85, 0xe0, 0x3f, 0xf3, 0xf0,

    /* U+0115 "ĕ" */
    0x85, 0xe3, 0x8f, 0x40, 0xe0,

    /* U+0116 "Ė" */
    0x10, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+0117 "ė" */
    0x30, 0x1f, 0xf8, 0x38,

    /* U+0118 "Ę" */
    0xfe, 0x8, 0x3c, 0x83, 0xf1, 0xc0,

    /* U+0119 "ę" */
    0x74, 0x7e, 0xe1, 0x80,

    /* U+011A "Ě" */
    0x30, 0x40, 0x3f, 0xf3, 0xf0,

    /* U+011B "ě" */
    0x51, 0x1c, 0xf8, 0x38,

    /* U+011C "Ĝ" */
    0x21, 0x40, 0x1f, 0x8d, 0xf0,

    /* U+011D "ĝ" */
    0x4a, 0xf, 0xf1, 0xe0,

    /* U+011E "Ğ" */
    0x82, 0xf8, 0x1, 0xf4, 0x67, 0xc0,

    /* U+011F "ğ" */
    0x85, 0xe0, 0x1e, 0x78, 0x27, 0x0,

    /* U+0120 "Ġ" */
    0x30, 0x7, 0xe7, 0x85, 0xf0,

    /* U+0121 "ġ" */
    0x20, 0x79, 0x71, 0x60,

    /* U+0122 "Ģ" */
    0x76, 0xf1, 0xfd, 0xbf, 0x80,

    /* U+0123 "ģ" */
    0x20, 0xc0, 0x1f, 0xfc, 0x3f, 0x80,

    /* U+0124 "Ĥ" */
    0x23, 0x1, 0xfd, 0x8c,

    /* U+0125 "ĥ" */
    0xdb, 0x9c, 0x3e, 0xcf, 0x30,

    /* U+0126 "Ħ" */
    0x6d, 0xfd, 0xb3, 0xe6, 0xcd, 0x80,

    /* U+0127 "ħ" */
    0xc7, 0x31, 0xed, 0xec,

    /* U+0128 "Ĩ" */
    0x63, 0x38, 0x1, 0xc1, 0x7, 0x0,

    /* U+0129 "ĩ" */
    0x63, 0x38, 0x1, 0x81, 0x7, 0x0,

    /* U+012A "Ī" */
    0xfc, 0x7, 0x8, 0x21, 0xc0,

    /* U+012B "ī" */
    0xfc, 0x6, 0x8, 0x21, 0xc0,

    /* U+012C "Ĭ" */
    0x82, 0xf8, 0x1, 0xc1, 0x7, 0x0,

    /* U+012D "ĭ" */
    0x82, 0xf8, 0x1, 0x81, 0x7, 0x0,

    /* U+012E "Į" */
    0xe2, 0x10, 0x84, 0x70, 0xe0,

    /* U+012F "į" */
    0x40, 0x30, 0x84, 0x70, 0xe0,

    /* U+0130 "İ" */
    0x63, 0xa5, 0xc0,

    /* U+0131 "ı" */
    0xc9, 0x70,

    /* U+0132 "Ĳ" */
    0xcf, 0x3c, 0xf3, 0xef, 0x60,

    /* U+0133 "ĳ" */
    0xd8, 0x37, 0xbd, 0xec, 0xc0,

    /* U+0134 "Ĵ" */
    0x21, 0x40, 0x3, 0xf, 0xe0,

    /* U+0135 "ĵ" */
    0x22, 0x80, 0x30, 0xc5, 0xc0,

    /* U+0136 "Ķ" */
    0x8c, 0xa5, 0xc9, 0x4c, 0xc0,

    /* U+0137 "ķ" */
    0x88, 0x9a, 0xeb, 0x20,

    /* U+0138 "ĸ" */
    0xcf, 0xed, 0xb3,

    /* U+0139 "Ĺ" */
    0x1c, 0xc, 0x30, 0xc3, 0xf0,

    /* U+013A "ĺ" */
    0x38, 0x38, 0xc6, 0x7c,

    /* U+013B "Ļ" */
    0x84, 0x21, 0x8, 0x7c, 0xc0,

    /* U+013C "ļ" */
    0x71, 0x8c, 0x63, 0x3f, 0x80,

    /* U+013D "Ľ" */
    0xcf, 0x6c, 0x30, 0xc3, 0xf0,

    /* U+013E "ľ" */
    0xe6, 0xd9, 0x83, 0x6, 0x1e, 0x0,

    /* U+013F "Ŀ" */
    0xc3, 0xc, 0x36, 0xc3, 0xf0,

    /* U+0140 "ŀ" */
    0x38, 0x38, 0xc6, 0x7c,

    /* U+0141 "Ł" */
    0x30, 0x61, 0xf7, 0xc3, 0x7, 0xc0,

    /* U+0142 "ł" */
    0xf0, 0xc7, 0xfe, 0x30, 0xf0,

    /* U+0143 "Ń" */
    0x38, 0x23, 0xda, 0xcc,

    /* U+0144 "ń" */
    0x38, 0x39, 0x49, 0x48,

    /* U+0145 "Ņ" */
    0x8e, 0x6b, 0x59, 0xc4, 0x80,

    /* U+0146 "ņ" */
    0xe9, 0x92, 0x20,

    /* U+0147 "Ň" */
    0x64, 0xd, 0xb1,

    /* U+0148 "ň" */
    0x61, 0x1, 0xe8, 0xc4,

    /* U+0149 "ŉ" */
    0xb8, 0xf3, 0xcf,

    /* U+014A "Ŋ" */
    0xfb, 0x3c, 0xf3, 0xcf, 0x61, 0x0,

    /* U+014B "ŋ" */
    0xf6, 0xf6, 0x23, 0x0,

    /* U+014C "Ō" */
    0xf8, 0x1d, 0x18, 0xb8,

    /* U+014D "ō" */
    0xf8, 0x1d, 0xbd, 0xb8,

    /* U+014E "Ŏ" */
    0x85, 0xe0, 0xe, 0x44, 0xe0,

    /* U+014F "ŏ" */
    0x85, 0xe0, 0xe, 0x6c, 0xe0,

    /* U+0150 "Ő" */
    0x4c, 0x80, 0xe8, 0xb8,

    /* U+0151 "ő" */
    0x4c, 0x80, 0xed, 0xb8,

    /* U+0152 "Œ" */
    0x7f, 0x6d, 0xb7, 0xd9, 0xf0,

    /* U+0153 "œ" */
    0x7f, 0xff, 0x1b,

    /* U+0154 "Ŕ" */
    0x38, 0x3d, 0xfd, 0x6c,

    /* U+0155 "ŕ" */
    0x18, 0x2f, 0x88, 0x40,

    /* U+0156 "Ŗ" */
    0xfb, 0x3c, 0xbe, 0xdb, 0x32, 0x0,

    /* U+0157 "ŗ" */
    0xfb, 0x3c, 0x30, 0xe0,

    /* U+0158 "Ř" */
    0x51, 0x1, 0xff, 0x6c,

    /* U+0159 "ř" */
    0x51, 0x0, 0xf8, 0x40,

    /* U+015A "Ś" */
    0x1c, 0x7, 0xfe, 0xf, 0xe0,

    /* U+015B "ś" */
    0x38, 0x1d, 0xc1, 0x70,

    /* U+015C "Ŝ" */
    0x10, 0xc7, 0xfe, 0xf, 0xe0,

    /* U+015D "ŝ" */
    0x22, 0x9f, 0xe0, 0xf8,

    /* U+015E "Ş" */
    0x74, 0x40, 0xe8, 0xb8, 0x80,

    /* U+015F "ş" */
    0x7f, 0x83, 0xe3, 0x0,

    /* U+0160 "Š" */
    0x30, 0x40, 0x3f, 0x1f, 0xe0,

    /* U+0161 "š" */
    0x61, 0x1, 0xf3, 0xf8,

    /* U+0162 "Ţ" */
    0xfc, 0xc3, 0xc, 0x30, 0xc7, 0x0,

    /* U+0163 "ţ" */
    0x63, 0x3e, 0xc6, 0x1f, 0x80,

    /* U+0164 "Ť" */
    0x50, 0x8f, 0xcc, 0x30, 0xc3, 0x0,

    /* U+0165 "ť" */
    0x6, 0xd9, 0x87, 0xc6, 0x7, 0x0,

    /* U+0166 "Ŧ" */
    0xfc, 0xc7, 0x8c, 0x30, 0xc0,

    /* U+0167 "ŧ" */
    0x63, 0x3f, 0xe6, 0x1c,

    /* U+0168 "Ũ" */
    0x66, 0x60, 0x21, 0x85, 0xe0,

    /* U+0169 "ũ" */
    0x66, 0x60, 0x12, 0x48, 0xc0,

    /* U+016A "Ū" */
    0x7c, 0x8, 0x61, 0x1, 0xe0,

    /* U+016B "ū" */
    0xf8, 0x25, 0x20, 0x30,

    /* U+016C "Ŭ" */
    0x85, 0xe0, 0x21, 0x85, 0xe0,

    /* U+016D "ŭ" */
    0x85, 0xe0, 0x12, 0x48, 0xc0,

    /* U+016E "Ů" */
    0x30, 0x0, 0x33, 0xcd, 0xe0,

    /* U+016F "ů" */
    0x30, 0x1, 0x18, 0xb8,

    /* U+0170 "Ű" */
    0x25, 0x20, 0x21, 0x85, 0xe0,

    /* U+0171 "ű" */
    0x4c, 0x81, 0x29, 0x30,

    /* U+0172 "Ų" */
    0x8c, 0x63, 0x18, 0xb8, 0xe0,

    /* U+0173 "ų" */
    0x94, 0x98, 0x70,

    /* U+0174 "Ŵ" */
    0x20, 0xc0, 0x33, 0xfc, 0x30,

    /* U+0175 "ŵ" */
    0x20, 0xc0, 0x33, 0x69, 0xe0,

    /* U+0176 "Ŷ" */
    0x22, 0xa2, 0xe2, 0x10,

    /* U+0177 "ŷ" */
    0x46, 0x9, 0x72, 0x60,

    /* U+0178 "Ÿ" */
    0x48, 0x22, 0xe2, 0x10,

    /* U+0179 "Ź" */
    0x1c, 0xf, 0xce, 0x63, 0xf0,

    /* U+017A "ź" */
    0x38, 0x3c, 0x44, 0x78,

    /* U+017B "Ż" */
    0x10, 0xf, 0xce, 0x63, 0xf0,

    /* U+017C "ż" */
    0x20, 0xf2, 0x4f,

    /* U+017D "Ž" */
    0x61, 0x1, 0xf7, 0x7c,

    /* U+017E "ž" */
    0x61, 0x1, 0xf7, 0x7c,

    /* U+017F "ſ" */
    0x7b, 0x3c, 0x30, 0xc3, 0x0,

    /* U+0180 "ƀ" */
    0x63, 0xc6, 0x1e, 0x6d, 0xe0,

    /* U+0181 "Ɓ" */
    0x7a, 0xf3, 0x8e, 0x3c, 0xe0,

    /* U+0182 "Ƃ" */
    0xfe, 0x31, 0xed, 0xf8,

    /* U+0183 "ƃ" */
    0xf6, 0x3d, 0xbd, 0xf8,

    /* U+0184 "Ƅ" */
    0x63, 0x86, 0x1e, 0x6d, 0xe0,

    /* U+0185 "ƅ" */
    0x63, 0x86, 0x1e, 0x6c, 0xe0,

    /* U+0186 "Ɔ" */
    0x7b, 0x30, 0xc3, 0xcd, 0xe0,

    /* U+0187 "Ƈ" */
    0xd, 0xfc, 0x30, 0x41, 0xf0,

    /* U+0188 "ƈ" */
    0x4, 0x37, 0xf0, 0xc1, 0xf0,

    /* U+0189 "Ɖ" */
    0x78, 0xd9, 0x9f, 0xb6, 0xcf, 0x0,

    /* U+018A "Ɗ" */
    0x7a, 0xf3, 0xcf, 0x3d, 0xe0,

    /* U+018B "Ƌ" */
    0x78, 0xc6, 0xfd, 0xbc,

    /* U+018C "ƌ" */
    0x78, 0xdf, 0xbd, 0xbc,

    /* U+018D "ƍ" */
    0x76, 0xdc, 0x33, 0x0,

    /* U+018E "Ǝ" */
    0xfc, 0x30, 0xdf, 0xf, 0xf0,

    /* U+018F "Ə" */
    0x76, 0xc7, 0xfd, 0xb8,

    /* U+0190 "Ɛ" */
    0x7b, 0x34, 0x1c, 0xcd, 0xe0,

    /* U+0191 "Ƒ" */
    0x7e, 0xc1, 0x83, 0xe6, 0xc, 0x30, 0x0,

    /* U+0192 "ƒ" */
    0xe, 0x1b, 0x18, 0x3c, 0x18, 0xd8, 0x70,

    /* U+0193 "Ɠ" */
    0x5, 0xfc, 0x37, 0x4d, 0xf0,

    /* U+0194 "Ɣ" */
    0xcf, 0x37, 0x8c, 0x78, 0xc0,

    /* U+0195 "ƕ" */
    0xc1, 0x83, 0x9f, 0xbd, 0x5b, 0x80,

    /* U+0197 "Ɨ" */
    0xfc, 0xc3, 0x3f, 0x33, 0xf0,

    /* U+0198 "Ƙ" */
    0xdf, 0x5f, 0x38, 0xd3, 0x60,

    /* U+0199 "ƙ" */
    0x7b, 0xc, 0xfe, 0xdb, 0x30,

    /* U+019A "ƚ" */
    0xf0, 0xc3, 0x3f, 0x30, 0xf0,

    /* U+019B "ƛ" */
    0x18, 0xf1, 0x9e, 0xdb, 0x60,

    /* U+019C "Ɯ" */
    0xdf, 0x7d, 0xf7, 0xdd, 0xf0,

    /* U+019D "Ɲ" */
    0xcf, 0xbe, 0xf7, 0xdf, 0x3c, 0x0,

    /* U+019E "ƞ" */
    0xf6, 0xf7, 0xb1, 0x80,

    /* U+019F "Ɵ" */
    0x7e, 0x73, 0xfd, 0xbc,

    /* U+01B7 "Ʒ" */
    0xfc, 0x63, 0x1e, 0x8f, 0xe0,

    /* U+01CD "Ǎ" */
    0x50, 0x80, 0x1e, 0xfe, 0x10,

    /* U+01CE "ǎ" */
    0x50, 0x80, 0x1f, 0x85, 0xf0,

    /* U+01CF "Ǐ" */
    0xa8, 0x75, 0xc0,

    /* U+01D0 "ǐ" */
    0xa8, 0x65, 0xc0,

    /* U+01D1 "Ǒ" */
    0x61, 0x0, 0xe8, 0xb8,

    /* U+01D2 "ǒ" */
    0x61, 0x0, 0xed, 0xb8,

    /* U+01D3 "Ǔ" */
    0x30, 0x80, 0x21, 0x85, 0xe0,

    /* U+01D4 "ǔ" */
    0x64, 0x9, 0x96,

    /* U+01D5 "Ǖ" */
    0xfd, 0xe0, 0x33, 0xcd, 0xe0,

    /* U+01D6 "ǖ" */
    0xfd, 0xe0, 0x12, 0x48, 0xc0,

    /* U+01D7 "Ǘ" */
    0x19, 0xac, 0x6, 0x6c, 0xcf, 0x0,

    /* U+01D8 "ǘ" */
    0x19, 0xac, 0x2, 0x44, 0x86, 0x0,

    /* U+01D9 "Ǚ" */
    0x39, 0xac, 0x6, 0x6c, 0xcf, 0x0,

    /* U+01DA "ǚ" */
    0x39, 0xac, 0x2, 0x44, 0x86, 0x0,

    /* U+01DB "Ǜ" */
    0x21, 0xac, 0x6, 0x6c, 0xcf, 0x0,

    /* U+01DC "ǜ" */
    0x21, 0xac, 0x2, 0x44, 0x86, 0x0,

    /* U+01DD "ǝ" */
    0x7b, 0xfc, 0xde,

    /* U+01DE "Ǟ" */
    0xfe, 0xd8, 0x1, 0xe7, 0xec, 0xc0,

    /* U+01DF "ǟ" */
    0xfd, 0x60, 0x1f, 0x85, 0xf0,

    /* U+01E0 "Ǡ" */
    0xfe, 0xd8, 0x1, 0xe7, 0xec, 0xc0,

    /* U+01E1 "ǡ" */
    0xfd, 0x60, 0x1f, 0x85, 0xf0,

    /* U+01E2 "Ǣ" */
    0x7c, 0x1, 0xff, 0xed, 0x83, 0xc0,

    /* U+01E3 "ǣ" */
    0x7c, 0x1, 0xfb, 0xfd, 0xf, 0xc0,

    /* U+01E6 "Ǧ" */
    0x50, 0x80, 0x1f, 0x8d, 0xf0,

    /* U+01E7 "ǧ" */
    0xa4, 0xf, 0xf1, 0xe0,

    /* U+01E8 "Ǩ" */
    0x28, 0x40, 0x3f, 0xcc, 0x10,

    /* U+01E9 "ǩ" */
    0x50, 0x80, 0x36, 0xf0, 0x30,

    /* U+01EE "Ǯ" */
    0x6c, 0xcf, 0xce, 0x8d, 0xe0,

    /* U+01EF "ǯ" */
    0xcc, 0xcf, 0xc2, 0x7b, 0x37, 0x80,

    /* U+01F0 "ǰ" */
    0x51, 0x0, 0x30, 0xc5, 0xc0,

    /* U+01F4 "Ǵ" */
    0x1c, 0x7, 0xe7, 0x85, 0xf0,

    /* U+01F5 "ǵ" */
    0x38, 0x1d, 0x27, 0x9, 0x80,

    /* U+01F8 "Ǹ" */
    0xe0, 0x23, 0xda, 0xcc,

    /* U+01F9 "ǹ" */
    0xc0, 0xea, 0x99,

    /* U+01FA "Ǻ" */
    0xcc, 0x60, 0x1e, 0xff, 0x30,

    /* U+01FB "ǻ" */
    0x6c, 0x20, 0x1f, 0x85, 0xf0,

    /* U+01FC "Ǽ" */
    0x1c, 0x1, 0xff, 0xed, 0x83, 0xc0,

    /* U+01FD "ǽ" */
    0x1c, 0x1, 0xfb, 0xfd, 0xf, 0xc0,

    /* U+01FE "Ǿ" */
    0x1c, 0x7, 0xff, 0xcf, 0xe0,

    /* U+01FF "ǿ" */
    0x1c, 0x17, 0xb7, 0xed, 0xe8, 0x0,

    /* U+0200 "Ȁ" */
    0x89, 0x10, 0x1e, 0xfe, 0x10,

    /* U+0201 "ȁ" */
    0x49, 0x10, 0x1f, 0x85, 0xf0,

    /* U+0202 "Ȃ" */
    0x7d, 0x4, 0x1, 0xe7, 0xe8, 0x40,

    /* U+0203 "ȃ" */
    0x7a, 0x10, 0x1f, 0x85, 0xf0,

    /* U+0204 "Ȅ" */
    0x48, 0x90, 0x3f, 0xf3, 0xf0,

    /* U+0205 "ȅ" */
    0x92, 0x5c, 0xf8, 0x38,

    /* U+0206 "Ȇ" */
    0x7a, 0x10, 0x3f, 0xf3, 0xf0,

    /* U+0207 "ȇ" */
    0x7a, 0x13, 0x8f, 0x40, 0xe0,

    /* U+0208 "Ȉ" */
    0x89, 0x10, 0x1c, 0x21, 0xc0,

    /* U+0209 "ȉ" */
    0x89, 0x10, 0x18, 0x21, 0xc0,

    /* U+020A "Ȋ" */
    0x7d, 0x4, 0x1, 0xc1, 0x7, 0x0,

    /* U+020B "ȋ" */
    0x7d, 0x4, 0x1, 0x81, 0x7, 0x0,

    /* U+020C "Ȍ" */
    0x92, 0x40, 0xe8, 0xb8,

    /* U+020D "ȍ" */
    0x92, 0x40, 0xed, 0xb8,

    /* U+020E "Ȏ" */
    0x7a, 0x10, 0xe, 0x44, 0xe0,

    /* U+020F "ȏ" */
    0x7a, 0x10, 0xe, 0x6c, 0xe0,

    /* U+0210 "Ȑ" */
    0x92, 0x41, 0xff, 0x6c,

    /* U+0211 "ȑ" */
    0x8a, 0x40, 0xf8, 0x40,

    /* U+0212 "Ȓ" */
    0x7a, 0x10, 0x1f, 0x79, 0xb0,

    /* U+0213 "ȓ" */
    0x7e, 0x10, 0xf, 0x41, 0x0,

    /* U+0214 "Ȕ" */
    0x48, 0x90, 0x21, 0x85, 0xe0,

    /* U+0215 "ȕ" */
    0x92, 0x41, 0x29, 0x30,

    /* U+0216 "Ȗ" */
    0x7a, 0x10, 0x21, 0x85, 0xe0,

    /* U+0217 "ȗ" */
    0x7a, 0x10, 0x12, 0x48, 0xc0,

    /* U+0218 "Ș" */
    0x74, 0x40, 0xe8, 0xb9, 0x80,

    /* U+0219 "ș" */
    0x7e, 0x1e, 0x60,

    /* U+021A "Ț" */
    0xf9, 0x8, 0x42, 0x19, 0x80,

    /* U+021B "ț" */
    0x42, 0x3c, 0x84, 0x99, 0x80,

    /* U+0226 "Ȧ" */
    0x20, 0x1d, 0xf8, 0x84,

    /* U+0227 "ȧ" */
    0x60, 0xef, 0x9f,

    /* U+022A "Ȫ" */
    0xfd, 0xe0, 0x1e, 0xcd, 0xe0,

    /* U+022B "ȫ" */
    0xfd, 0xe0, 0xe, 0x6c, 0xe0,

    /* U+022C "Ȭ" */
    0xfd, 0xa9, 0x1e, 0xcd, 0xe0,

    /* U+022D "ȭ" */
    0xfd, 0xa9, 0xa, 0x6c, 0xe0,

    /* U+022E "Ȯ" */
    0x20, 0x1d, 0x18, 0xb8,

    /* U+022F "ȯ" */
    0x20, 0x1d, 0xbd, 0xb8,

    /* U+0230 "Ȱ" */
    0xfd, 0xe0, 0x1e, 0xcd, 0xe0,

    /* U+0231 "ȱ" */
    0xfd, 0xe0, 0xe, 0x6c, 0xe0,

    /* U+0232 "Ȳ" */
    0xfc, 0x8, 0x9c, 0x20, 0x80,

    /* U+0233 "ȳ" */
    0xf8, 0x25, 0x27, 0x9, 0x80,

    /* U+0258 "ɘ" */
    0xfb, 0xf0, 0xde,

    /* U+0259 "ə" */
    0x7b, 0xfc, 0xde,

    /* U+0263 "ɣ" */
    0xcd, 0xe3, 0x1e, 0x30,

    /* U+0292 "ʒ" */
    0xfc, 0x37, 0xb3, 0x78,

    /* U+0294 "ʔ" */
    0x7b, 0x30, 0x86, 0x30, 0xc0,

    /* U+02C6 "ˆ" */
    0x70,

    /* U+02C9 "ˉ" */
    0xe0,

    /* U+02CD "ˍ" */
    0xe0,

    /* U+02DC "˜" */
    0x66, 0x60,

    /* U+0300 "̀" */
    0xe0,

    /* U+0301 "́" */
    0xe0,

    /* U+0302 "̂" */
    0x26, 0xc0,

    /* U+0303 "̃" */
    0x7f, 0x60,

    /* U+0304 "̄" */
    0xf8,

    /* U+0305 "̅" */
    0xfe,

    /* U+0306 "̆" */
    0xcd, 0xe0,

    /* U+0307 "̇" */
    0x80,

    /* U+0308 "̈" */
    0xd8,

    /* U+0309 "̉" */
    0x98,

    /* U+030A "̊" */
    0xc0,

    /* U+030B "̋" */
    0x6f, 0x60,

    /* U+030C "̌" */
    0xd9, 0x0,

    /* U+030D "̍" */
    0x90,

    /* U+030F "̏" */
    0xd9, 0xb0,

    /* U+0310 "̐" */
    0xaa, 0x88,

    /* U+0311 "̑" */
    0x7b, 0x30,

    /* U+0313 "̓" */
    0x70,

    /* U+0314 "̔" */
    0xd0,

    /* U+0315 "̕" */
    0x78,

    /* U+0316 "̖" */
    0xe0,

    /* U+0317 "̗" */
    0xe0,

    /* U+0318 "̘" */
    0x8f,

    /* U+031B "̛" */
    0x78,

    /* U+031C "̜" */
    0xc0,

    /* U+031F "̟" */
    0x2f,

    /* U+0320 "̠" */
    0xf9,

    /* U+0321 "̡" */
    0x3e,

    /* U+0322 "̢" */
    0xc7,

    /* U+0323 "̣" */
    0x80,

    /* U+0324 "̤" */
    0xd8,

    /* U+0325 "̥" */
    0x80,

    /* U+0326 "̦" */
    0x70,

    /* U+0327 "̧" */
    0x70,

    /* U+0328 "̨" */
    0xe0,

    /* U+0329 "̩" */
    0x80,

    /* U+032B "̫" */
    0x95, 0xe0,

    /* U+032C "̬" */
    0xd9, 0x0,

    /* U+032E "̮" */
    0xcd, 0xe0,

    /* U+0330 "̰" */
    0x7f, 0x60,

    /* U+0332 "̲" */
    0xfe,

    /* U+0333 "̳" */
    0xfe,

    /* U+0335 "̵" */
    0xf8,

    /* U+0336 "̶" */
    0xfe,

    /* U+0337 "̷" */
    0x19, 0x99, 0x80,

    /* U+0338 "̸" */
    0x6, 0x18, 0x40, 0x82, 0x8, 0x20, 0x0,

    /* U+0339 "̹" */
    0xc0,

    /* U+033A "̺" */
    0x9f,

    /* U+033B "̻" */
    0xe0,

    /* U+033C "̼" */
    0x7a, 0x50,

    /* U+033D "̽" */
    0x96, 0x90,

    /* U+033E "̾" */
    0xfe,

    /* U+0340 "̀" */
    0xe0,

    /* U+0341 "́" */
    0xe0,

    /* U+0342 "͂" */
    0x7f, 0x60,

    /* U+0343 "̓" */
    0x70,

    /* U+0344 "̈́" */
    0x19, 0xac,

    /* U+034F "͏" */
    0x0,

    /* U+0362 "͢" */
    0xb, 0xf0,

    /* U+0386 "Ά" */
    0x38, 0x1d, 0xfd, 0x8c,

    /* U+0388 "Έ" */
    0x1c, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+0389 "Ή" */
    0x38, 0x37, 0xfd, 0xec,

    /* U+038A "Ί" */
    0x1c, 0xf, 0xcc, 0x33, 0xf0,

    /* U+038C "Ό" */
    0x1c, 0x7, 0xb3, 0xcd, 0xe0,

    /* U+038E "Ύ" */
    0x18, 0x32, 0x93, 0x18,

    /* U+038F "Ώ" */
    0x7d, 0x3c, 0xf3, 0x7b, 0xf0,

    /* U+0391 "Α" */
    0x22, 0xb7, 0xfd, 0xec,

    /* U+0392 "Β" */
    0xf6, 0xf5, 0xed, 0xf8,

    /* U+0393 "Γ" */
    0xff, 0xc, 0x30, 0xc3, 0x0,

    /* U+0394 "Δ" */
    0x21, 0xec, 0xf3, 0xcf, 0xf0,

    /* U+0395 "Ε" */
    0xff, 0xc, 0x3e, 0xc3, 0xf0,

    /* U+0396 "Ζ" */
    0xfc, 0x31, 0x98, 0xc3, 0xf0,

    /* U+0397 "Η" */
    0xde, 0xf7, 0xfd, 0xec,

    /* U+0398 "Θ" */
    0x7b, 0x3c, 0xff, 0xcd, 0xe0,

    /* U+0399 "Ι" */
    0xfc, 0xc3, 0xc, 0x33, 0xf0,

    /* U+039A "Κ" */
    0xc7, 0x3d, 0x3c, 0xcf, 0x10,

    /* U+039B "Λ" */
    0x20, 0xc4, 0xb3, 0xcc, 0x30,

    /* U+039C "Μ" */
    0xcf, 0xfe, 0xf3, 0xcf, 0x30,

    /* U+039D "Ν" */
    0xcf, 0xbe, 0xf7, 0xcf, 0x30,

    /* U+039E "Ξ" */
    0xff, 0x30, 0x1e, 0xcf, 0xf0,

    /* U+039F "Ο" */
    0x76, 0xf7, 0xbd, 0xb8,

    /* U+03A0 "Π" */
    0xff, 0x3c, 0xf3, 0xcf, 0x30,

    /* U+03A1 "Ρ" */
    0xf6, 0xfd, 0x8c, 0x60,

    /* U+03A3 "Σ" */
    0xfd, 0x83, 0x4, 0x63, 0xf0,

    /* U+03A4 "Τ" */
    0xfc, 0xc3, 0xc, 0x30, 0xc0,

    /* U+03A5 "Υ" */
    0xce, 0x52, 0xa3, 0x18,

    /* U+03A6 "Φ" */
    0x11, 0xed, 0xf7, 0x78, 0x40,

    /* U+03A7 "Χ" */
    0xc6, 0xd8, 0x40, 0x86, 0xd8, 0xc0,

    /* U+03A8 "Ψ" */
    0x10, 0x4d, 0xf7, 0x78, 0x40,

    /* U+03A9 "Ω" */
    0x79, 0x2c, 0xf3, 0x7b, 0xf0,

    /* U+03AA "Ϊ" */
    0x48, 0xf, 0xcc, 0x33, 0xf0,

    /* U+03AB "Ϋ" */
    0x48, 0x32, 0x93, 0x18,

    /* U+03AC "ά" */
    0xc, 0x7, 0xf3, 0xcd, 0xf0,

    /* U+03AD "έ" */
    0x38, 0x1f, 0xec, 0x3c,

    /* U+03AE "ή" */
    0x38, 0x3d, 0xbd, 0xec, 0x60,

    /* U+03AF "ί" */
    0x70, 0xcc, 0x46,

    /* U+03B1 "α" */
    0x7f, 0x3c, 0xdf,

    /* U+03B2 "β" */
    0x7b, 0x3c, 0xbe, 0xef, 0x6c, 0x0,

    /* U+03B3 "γ" */
    0xcd, 0xe3, 0x1e, 0x30,

    /* U+03B4 "δ" */
    0xfd, 0x82, 0x1e, 0xcd, 0xe0,

    /* U+03B5 "ε" */
    0x7f, 0xb0, 0xf0,

    /* U+03B6 "ζ" */
    0xff, 0x30, 0x9c, 0xc1, 0xe0, 0x40,

    /* U+03B7 "η" */
    0xf6, 0xf7, 0xb1, 0x80,

    /* U+03B8 "θ" */
    0x76, 0xf7, 0xfd, 0xb8,

    /* U+03B9 "ι" */
    0xd9, 0x30,

    /* U+03BA "κ" */
    0xcf, 0xed, 0xb3,

    /* U+03BB "λ" */
    0x73, 0x60, 0xdf, 0xcf, 0x30,

    /* U+03BC "μ" */
    0xc3, 0x6d, 0xbb, 0xc0,

    /* U+03BD "ν" */
    0xde, 0xd4, 0x40,

    /* U+03BE "ξ" */
    0xfc, 0x37, 0xb0, 0xe1, 0xe0, 0x40,

    /* U+03BF "ο" */
    0x76, 0xf6, 0xe0,

    /* U+03C0 "π" */
    0xfe, 0xd9, 0xb3, 0x66, 0xc0,

    /* U+03C1 "ρ" */
    0x76, 0xfd, 0x8c, 0x0,

    /* U+03C2 "ς" */
    0x7f, 0x1c, 0x1f, 0x4,

    /* U+03C3 "σ" */
    0x7f, 0x6c, 0xde,

    /* U+03C4 "τ" */
    0xfc, 0xc3, 0x6,

    /* U+03C5 "υ" */
    0xcd, 0xb2, 0x8e,

    /* U+03C6 "φ" */
    0x5b, 0xf7, 0x8c, 0x30,

    /* U+03C7 "χ" */
    0xcd, 0xe7, 0xb3,

    /* U+03C8 "ψ" */
    0xcf, 0xf7, 0x8c, 0x30,

    /* U+03C9 "ω" */
    0xcf, 0x76, 0x9a,

    /* U+03CA "ϊ" */
    0x90, 0x66, 0x23,

    /* U+03CB "ϋ" */
    0x28, 0xc, 0xdb, 0x28, 0xe0,

    /* U+03CC "ό" */
    0x38, 0x1d, 0xbd, 0xb8,

    /* U+03CD "ύ" */
    0x1c, 0xc, 0xdb, 0x28, 0xe0,

    /* U+03CE "ώ" */
    0xc, 0xc, 0xf7, 0x69, 0xa0,

    /* U+0400 "Ѐ" */
    0x70, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+0401 "Ё" */
    0x28, 0xf, 0xfc, 0xc3, 0xf0,

    /* U+0405 "Ѕ" */
    0x74, 0x40, 0xe8, 0xb8,

    /* U+0406 "І" */
    0xe9, 0x25, 0xc0,

    /* U+0407 "Ї" */
    0x90, 0xe4, 0x4e,

    /* U+0408 "Ј" */
    0x8, 0x42, 0x18, 0xb8,

    /* U+0409 "Љ" */
    0x39, 0xe7, 0x9e, 0x7f, 0x60,

    /* U+0410 "А" */
    0x22, 0xb7, 0xfd, 0xec,

    /* U+0411 "Б" */
    0xfe, 0x31, 0xed, 0xf8,

    /* U+0412 "В" */
    0xf6, 0xf5, 0xed, 0xf8,

    /* U+0413 "Г" */
    0xff, 0xc, 0x30, 0xc3, 0x0,

    /* U+0414 "Д" */
    0x1c, 0x79, 0xb3, 0x66, 0xcf, 0xb1, 0x80,

    /* U+0415 "Е" */
    0xff, 0xc, 0x3e, 0xc3, 0xf0,

    /* U+0416 "Ж" */
    0xdd, 0x63, 0xc, 0x5b, 0x70,

    /* U+0417 "З" */
    0x7b, 0x30, 0x8e, 0xcd, 0xe0,

    /* U+0418 "И" */
    0xcf, 0x3d, 0xfb, 0xef, 0x30,

    /* U+0419 "Й" */
    0x33, 0x3d, 0xfb, 0xef, 0x30,

    /* U+041A "К" */
    0xc7, 0x3d, 0x3c, 0xcf, 0x10,

    /* U+041B "Л" */
    0x1c, 0xf6, 0xdb, 0x6f, 0x30,

    /* U+041C "М" */
    0xcf, 0xfe, 0xf3, 0xcf, 0x30,

    /* U+041D "Н" */
    0xde, 0xf7, 0xfd, 0xec,

    /* U+041E "О" */
    0x76, 0xf7, 0xbd, 0xb8,

    /* U+041F "П" */
    0xfe, 0xf7, 0xbd, 0xec,

    /* U+0420 "Р" */
    0xf6, 0xfd, 0x8c, 0x60,

    /* U+0421 "С" */
    0x7b, 0x3c, 0x30, 0xcd, 0xe0,

    /* U+0422 "Т" */
    0xfc, 0xc3, 0xc, 0x30, 0xc0,

    /* U+0423 "У" */
    0xde, 0xd6, 0xf1, 0xf8,

    /* U+0424 "Ф" */
    0x11, 0xed, 0xf7, 0x78, 0x40,

    /* U+0425 "Х" */
    0xc6, 0xd8, 0x40, 0x86, 0xd8, 0xc0,

    /* U+0426 "Ц" */
    0xdb, 0x6d, 0xb6, 0xdb, 0xf0, 0xc0,

    /* U+0427 "Ч" */
    0xcf, 0x34, 0xdf, 0xc, 0x30,

    /* U+0428 "Ш" */
    0xdf, 0x7d, 0xf7, 0xdf, 0xf0,

    /* U+0429 "Щ" */
    0xdd, 0xbb, 0x76, 0xed, 0xdf, 0xc1, 0x80,

    /* U+042A "Ъ" */
    0xf2, 0xc3, 0xe, 0x3c, 0xe0,

    /* U+042B "Ы" */
    0xcf, 0x3c, 0xfb, 0xdf, 0xb0,

    /* U+042C "Ь" */
    0xc6, 0x31, 0xed, 0xf8,

    /* U+042D "Э" */
    0x73, 0x60, 0xcf, 0xd9, 0xc0,

    /* U+042E "Ю" */
    0xdb, 0x7d, 0xff, 0xdf, 0x60,

    /* U+042F "Я" */
    0x7e, 0xf6, 0xf7, 0xec,

    /* U+0430 "а" */
    0x73, 0xf6, 0xf0,

    /* U+0431 "б" */
    0x1b, 0xb1, 0xe5, 0xb8,

    /* U+0432 "в" */
    0xf7, 0xf7, 0xe0,

    /* U+0433 "г" */
    0xff, 0xc, 0x30, 0xc0,

    /* U+0434 "д" */
    0x3c, 0xd9, 0xb3, 0xec, 0x60,

    /* U+0435 "е" */
    0x7f, 0xfc, 0x1e,

    /* U+0436 "ж" */
    0xdd, 0xe7, 0xb7,

    /* U+0437 "з" */
    0x7b, 0x7c, 0xde,

    /* U+0438 "и" */
    0xcf, 0x7e, 0xfb,

    /* U+0439 "й" */
    0x33, 0x3d, 0xfb, 0xec,

    /* U+043A "к" */
    0xcf, 0xed, 0xb3,

    /* U+043B "л" */
    0x3d, 0xb6, 0xfb,

    /* U+043C "м" */
    0xcf, 0xfc, 0xf3,

    /* U+043D "н" */
    0xdf, 0xf7, 0xb0,

    /* U+043E "о" */
    0x76, 0xf6, 0xe0,

    /* U+043F "п" */
    0xfe, 0xf7, 0xbd, 0x80,

    /* U+0440 "р" */
    0xf6, 0xfd, 0x8c, 0x0,

    /* U+0441 "с" */
    0x7e, 0x30, 0xf0,

    /* U+0442 "т" */
    0xfc, 0xc3, 0xc, 0x30,

    /* U+0443 "у" */
    0xde, 0xde, 0x37, 0x0,

    /* U+0444 "ф" */
    0x10, 0x47, 0xb7, 0x78, 0x41, 0x0,

    /* U+0445 "х" */
    0xcd, 0xe7, 0xb3,

    /* U+0446 "ц" */
    0xdb, 0x6d, 0xbf, 0xc,

    /* U+0447 "ч" */
    0xdb, 0xc6, 0x30,

    /* U+0448 "ш" */
    0xdf, 0x7d, 0xff,

    /* U+0449 "щ" */
    0xdf, 0x7d, 0xff, 0xc,

    /* U+044A "ъ" */
    0xc1, 0xe4, 0xde,

    /* U+044B "ы" */
    0xcf, 0xbd, 0xfb,

    /* U+044C "ь" */
    0xc3, 0xec, 0xfe,

    /* U+044D "э" */
    0x7b, 0xfc, 0xde,

    /* U+044E "ю" */
    0xdb, 0xbe, 0xf6,

    /* U+044F "я" */
    0xff, 0xf7, 0x30,

    /* U+0450 "ѐ" */
    0xe0, 0x1f, 0xf8, 0x38,

    /* U+0451 "ё" */
    0x48, 0x1f, 0xf8, 0x38,

    /* U+0455 "ѕ" */
    0x7e, 0x1e,

    /* U+0456 "і" */
    0x43, 0x25, 0xc0,

    /* U+0457 "ї" */
    0x90, 0xc4, 0x4e,

    /* U+0458 "ј" */
    0x10, 0x31, 0x19, 0x60,

    /* U+04D0 "Ӑ" */
    0x82, 0xf8, 0x1, 0xe7, 0xe8, 0x40,

    /* U+04D1 "ӑ" */
    0x85, 0xe0, 0x1f, 0x85, 0xf0,

    /* U+04D2 "Ӓ" */
    0x50, 0x1d, 0xf8, 0x84,

    /* U+04D3 "ӓ" */
    0x90, 0xef, 0x9f,

    /* U+04D4 "Ӕ" */
    0x3e, 0xf3, 0x67, 0xed, 0x9b, 0xc0,

    /* U+04D5 "ӕ" */
    0x7e, 0xff, 0x43, 0xf0,

    /* U+04D6 "Ӗ" */
    0x85, 0xe0, 0x3f, 0xf3, 0xf0,

    /* U+04D7 "ӗ" */
    0x85, 0xe3, 0x8f, 0x40, 0xe0,

    /* U+04E6 "Ӧ" */
    0x50, 0x1d, 0x18, 0xb8,

    /* U+04E7 "ӧ" */
    0x50, 0x1d, 0xbd, 0xb8,

    /* U+04F1 "ӱ" */
    0x50, 0x99, 0x71, 0x60,

    /* U+05D0 "א" */
    0xfb, 0xb7, 0xb0,

    /* U+05D1 "ב" */
    0xf0, 0x61, 0xbf,

    /* U+05D2 "ג" */
    0xe7, 0xfb,

    /* U+05D3 "ד" */
    0xfc, 0x61, 0x86, 0x18,

    /* U+05D4 "ה" */
    0xf0, 0xf7, 0xb0,

    /* U+05D5 "ו" */
    0xcd, 0xb0,

    /* U+05D6 "ז" */
    0xfc, 0x63, 0xc,

    /* U+05D7 "ח" */
    0xf6, 0xf7, 0xb0,

    /* U+05D8 "ט" */
    0xc3, 0x6d, 0xf7, 0x78,

    /* U+05D9 "י" */
    0xe3, 0x30,

    /* U+05DA "ך" */
    0xf8, 0x30, 0xc3, 0xc, 0x30,

    /* U+05DB "כ" */
    0xf0, 0xc7, 0xe0,

    /* U+05DC "ל" */
    0xc3, 0xe0, 0xc7, 0x30, 0xc0,

    /* U+05DD "ם" */
    0xf9, 0xb6, 0xdf,

    /* U+05DE "מ" */
    0xf6, 0xf7, 0xbd, 0x80,

    /* U+05DF "ן" */
    0xcd, 0xb6,

    /* U+05E0 "נ" */
    0x63, 0x3f,

    /* U+05E1 "ס" */
    0xfe, 0xf6, 0xe0,

    /* U+05E2 "ע" */
    0x6d, 0xb6, 0xfe,

    /* U+05E3 "ף" */
    0xfb, 0xb0, 0xc3, 0xc,

    /* U+05E4 "פ" */
    0xfb, 0xb0, 0xfe,

    /* U+05E5 "ץ" */
    0xde, 0xdc, 0xc6, 0x0,

    /* U+05E6 "צ" */
    0xdb, 0x87, 0xf0,

    /* U+05E7 "ק" */
    0xf3, 0xff, 0xc0,

    /* U+05E8 "ר" */
    0xf0, 0xc6, 0x30,

    /* U+05E9 "ש" */
    0xef, 0xbe, 0xde,

    /* U+05EA "ת" */
    0xff, 0x3c, 0xe3,

    /* U+0623 "أ" */
    0x78, 0x92,

    /* U+0627 "ا" */
    0xf0,

    /* U+0628 "ب" */
    0x82, 0xf8, 0x0, 0x80,

    /* U+0629 "ة" */
    0xdb, 0xd2, 0xf0,

    /* U+062A "ت" */
    0x3d, 0x6, 0xb, 0xe0,

    /* U+062B "ث" */
    0x7c, 0x2, 0xb, 0xe0,

    /* U+062C "ج" */
    0x7b, 0xe1, 0x67, 0x80,

    /* U+062D "ح" */
    0x7b, 0xe1, 0x7, 0x80,

    /* U+062F "د" */
    0x20, 0xa3, 0xf0,

    /* U+0630 "ذ" */
    0xd0, 0x24, 0x5f,

    /* U+0631 "ر" */
    0x8, 0x45, 0xc0,

    /* U+0632 "ز" */
    0x18, 0x42, 0x2e, 0x0,

    /* U+0633 "س" */
    0x17, 0xfc, 0x0,

    /* U+0634 "ش" */
    0x10, 0xa1, 0x7f, 0xc0, 0x0,

    /* U+0635 "ص" */
    0x7f, 0xfc, 0x0,

    /* U+0637 "ط" */
    0x10, 0x10, 0x17, 0x19, 0xff,

    /* U+0638 "ظ" */
    0x10, 0x16, 0x17, 0x19, 0xff,

    /* U+0639 "ع" */
    0x3b, 0xe1, 0x7, 0x80,

    /* U+063A "غ" */
    0xc1, 0xdf, 0x8, 0x3c,

    /* U+0640 "ـ" */
    0xfe,

    /* U+0641 "ف" */
    0xd, 0x3e, 0x4b, 0xf0,

    /* U+0642 "ق" */
    0x36, 0x0, 0x7c, 0xf8, 0x2f, 0x80,

    /* U+0643 "ك" */
    0x16, 0x98, 0x5e,

    /* U+0644 "ل" */
    0x2, 0x4, 0xc, 0x18, 0x2f, 0x80,

    /* U+0645 "م" */
    0x33, 0x65, 0x8, 0x0,

    /* U+0646 "ن" */
    0x11, 0x6, 0xb, 0xe0,

    /* U+0647 "ه" */
    0xf7, 0x80,

    /* U+0648 "و" */
    0x18, 0x70, 0x7e,

    /* U+0649 "ى" */
    0x1e, 0x38, 0x5e,

    /* U+064A "ي" */
    0xc, 0x48, 0xde, 0x1, 0xe0,

    /* U+0671 "ٱ" */
    0x3b, 0xf2, 0x8, 0x20,

    /* U+0672 "ٲ" */
    0xf, 0x70, 0x8, 0x20,

    /* U+0673 "ٳ" */
    0x20, 0x82, 0x3, 0x52, 0x30
};


/*---------------------
 *  GLYPH DESCRIPTION
 *--------------------*/

static const lv_font_fmt_txt_glyph_dsc_t glyph_dsc[] = {
    {.bitmap_index = 0, .adv_w = 0, .box_w = 0, .box_h = 0, .ofs_x = 0, .ofs_y = 0} /* id = 0 reserved */,
    {.bitmap_index = 0, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 6},
    {.bitmap_index = 1, .adv_w = 112, .box_w = 1, .box_h = 5, .ofs_x = 3, .ofs_y = 1},
    {.bitmap_index = 2, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 2, .ofs_y = 4},
    {.bitmap_index = 3, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 8, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 11, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 15, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 20, .adv_w = 112, .box_w = 2, .box_h = 3, .ofs_x = 2, .ofs_y = 4},
    {.bitmap_index = 21, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 24, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 27, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 31, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 34, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 35, .adv_w = 112, .box_w = 4, .box_h = 1, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 36, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 3, .ofs_y = 1},
    {.bitmap_index = 37, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 42, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 45, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 49, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 53, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 57, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 61, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 65, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 68, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 72, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 75, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 78, .adv_w = 112, .box_w = 1, .box_h = 3, .ofs_x = 3, .ofs_y = 2},
    {.bitmap_index = 79, .adv_w = 112, .box_w = 2, .box_h = 5, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 81, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 84, .adv_w = 112, .box_w = 4, .box_h = 3, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 86, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 89, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 94, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 98, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 102, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 106, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 110, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 114, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 118, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 122, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 126, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 130, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 133, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 137, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 141, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 145, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 149, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 153, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 157, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 161, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 165, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 169, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 173, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 177, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 181, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 185, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 189, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 193, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 197, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 201, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 204, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 209, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 212, .adv_w = 112, .box_w = 4, .box_h = 3, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 214, .adv_w = 112, .box_w = 4, .box_h = 1, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 215, .adv_w = 112, .box_w = 2, .box_h = 3, .ofs_x = 2, .ofs_y = 4},
    {.bitmap_index = 216, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 218, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 221, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 224, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 227, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 230, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 235, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 238, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 241, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 244, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 248, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 252, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 255, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 258, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 260, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 262, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 265, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 268, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 271, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 273, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 277, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 279, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 281, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 284, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 286, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 289, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 291, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 294, .adv_w = 112, .box_w = 1, .box_h = 7, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 295, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 298, .adv_w = 112, .box_w = 4, .box_h = 3, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 300, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 305, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 311, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 316, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 322, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 327, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 333, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 339, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 345, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 351, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 357, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 363, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = -1, .ofs_y = 1},
    {.bitmap_index = 370, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 376, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 382, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 388, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 394, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 399, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 406, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 411, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 417, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 423, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 429, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 434, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 440, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 446, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 451, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 456, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 461, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 467, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 472, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 478, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 484, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 490, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 6},
    {.bitmap_index = 491, .adv_w = 112, .box_w = 2, .box_h = 6, .ofs_x = 3, .ofs_y = 1},
    {.bitmap_index = 493, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 497, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 503, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 506, .adv_w = 112, .box_w = 8, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 512, .adv_w = 112, .box_w = 2, .box_h = 6, .ofs_x = 3, .ofs_y = 1},
    {.bitmap_index = 514, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 519, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 2, .ofs_y = 6},
    {.bitmap_index = 520, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 527, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 531, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 535, .adv_w = 112, .box_w = 6, .box_h = 3, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 538, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 2, .ofs_y = 3},
    {.bitmap_index = 539, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 546, .adv_w = 112, .box_w = 5, .box_h = 1, .ofs_x = 1, .ofs_y = 6},
    {.bitmap_index = 547, .adv_w = 112, .box_w = 5, .box_h = 3, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 549, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 554, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 556, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 558, .adv_w = 112, .box_w = 3, .box_h = 3, .ofs_x = 2, .ofs_y = 4},
    {.bitmap_index = 560, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 564, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 570, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 3, .ofs_y = 3},
    {.bitmap_index = 571, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 572, .adv_w = 112, .box_w = 3, .box_h = 4, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 574, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 577, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 581, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 588, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 595, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 602, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 607, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 611, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 615, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 620, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 626, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 630, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 635, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 641, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 646, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 651, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 656, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 661, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 666, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 669, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 673, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 676, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 679, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 685, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 690, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 694, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 698, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 702, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 707, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 711, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 714, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 718, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 723, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 728, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 733, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 738, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 743, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 748, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 752, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 755, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 759, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 764, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 769, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 772, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 778, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 782, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 785, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 789, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 793, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 797, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 801, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 804, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 808, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 811, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 814, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 819, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 824, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 828, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 832, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 836, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 841, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 845, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 850, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 855, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 858, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 862, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 865, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 868, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 873, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 878, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 882, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 886, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 890, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 896, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 901, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 906, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 910, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 915, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 919, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 924, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 928, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 933, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 937, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 942, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 946, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 950, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 955, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 961, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 966, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 971, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 975, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 980, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 985, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 990, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 994, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1000, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1004, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1009, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1013, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1018, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1022, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1028, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1034, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1039, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1043, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1048, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1054, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1058, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1063, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1069, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1073, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1079, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1085, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1090, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1095, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1101, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1107, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 1112, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 1117, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 1120, .adv_w = 112, .box_w = 3, .box_h = 4, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 1122, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1127, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1132, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1137, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1142, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1147, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1151, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1154, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1159, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 1163, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1168, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1173, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1178, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1184, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1189, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 1193, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1199, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1204, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1208, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1212, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1217, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1220, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1223, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1227, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1230, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1236, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1240, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1244, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1248, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1253, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1258, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1262, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1266, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1271, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1274, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1278, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1282, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1288, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1292, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1296, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1300, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1305, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1309, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1314, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1318, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1323, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1327, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1332, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1336, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1342, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1347, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1353, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1359, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1364, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1368, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1373, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1378, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1383, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1387, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1392, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1397, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1402, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1406, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1411, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1415, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1420, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1423, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1428, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1433, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1437, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1441, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1445, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1450, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1454, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1459, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1462, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1466, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1470, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1475, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1480, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1485, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1489, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1493, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1498, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1503, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1508, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1513, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1518, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1524, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1529, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1533, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1537, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1541, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1546, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1550, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1555, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1562, .adv_w = 112, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1569, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1574, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1579, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1585, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1590, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1595, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1600, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1605, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1610, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1615, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1621, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1625, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1629, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1634, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1639, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1644, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 1647, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 1650, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1654, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1658, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1663, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1666, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1671, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1676, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1682, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1688, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1694, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1700, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1706, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1712, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1715, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1721, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1726, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1732, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1737, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1743, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1749, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1754, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1758, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1763, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1768, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1773, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1779, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1784, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1789, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1794, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1798, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1801, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1806, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1811, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1817, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1823, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1828, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1834, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1839, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1844, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1850, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1855, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1860, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1864, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1869, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1874, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1879, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1884, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1890, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1896, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1900, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1904, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1909, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1914, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1918, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1922, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1927, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1932, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1937, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1941, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1946, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1951, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1956, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1959, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1964, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1969, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1973, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1976, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1981, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1986, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1991, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 1996, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2000, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2004, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2009, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2014, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2019, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2024, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2027, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2030, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2034, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2038, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2043, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 5},
    {.bitmap_index = 2044, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 2, .ofs_y = 6},
    {.bitmap_index = 2045, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2046, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2048, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 6},
    {.bitmap_index = 2049, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 3, .ofs_y = 6},
    {.bitmap_index = 2050, .adv_w = 112, .box_w = 5, .box_h = 2, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 2052, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2054, .adv_w = 112, .box_w = 5, .box_h = 1, .ofs_x = 1, .ofs_y = 6},
    {.bitmap_index = 2055, .adv_w = 112, .box_w = 7, .box_h = 1, .ofs_x = 0, .ofs_y = 6},
    {.bitmap_index = 2056, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2058, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 3, .ofs_y = 6},
    {.bitmap_index = 2059, .adv_w = 112, .box_w = 5, .box_h = 1, .ofs_x = 1, .ofs_y = 6},
    {.bitmap_index = 2060, .adv_w = 112, .box_w = 2, .box_h = 3, .ofs_x = 3, .ofs_y = 4},
    {.bitmap_index = 2061, .adv_w = 112, .box_w = 2, .box_h = 1, .ofs_x = 3, .ofs_y = 5},
    {.bitmap_index = 2062, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2064, .adv_w = 112, .box_w = 5, .box_h = 2, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 2066, .adv_w = 112, .box_w = 4, .box_h = 1, .ofs_x = 2, .ofs_y = 5},
    {.bitmap_index = 2067, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2069, .adv_w = 112, .box_w = 5, .box_h = 3, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 2071, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2073, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 5},
    {.bitmap_index = 2074, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 5},
    {.bitmap_index = 2075, .adv_w = 112, .box_w = 3, .box_h = 2, .ofs_x = 4, .ofs_y = 5},
    {.bitmap_index = 2076, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2077, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2078, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2079, .adv_w = 112, .box_w = 3, .box_h = 2, .ofs_x = 4, .ofs_y = 5},
    {.bitmap_index = 2080, .adv_w = 112, .box_w = 2, .box_h = 1, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2081, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2082, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2083, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2084, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2085, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2086, .adv_w = 112, .box_w = 5, .box_h = 1, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2087, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2088, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2089, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2090, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2091, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2092, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2094, .adv_w = 112, .box_w = 5, .box_h = 2, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2096, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2098, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2100, .adv_w = 112, .box_w = 7, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2101, .adv_w = 112, .box_w = 7, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2102, .adv_w = 112, .box_w = 5, .box_h = 1, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 2103, .adv_w = 112, .box_w = 7, .box_h = 1, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2104, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2107, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2114, .adv_w = 112, .box_w = 2, .box_h = 1, .ofs_x = 3, .ofs_y = 0},
    {.bitmap_index = 2115, .adv_w = 112, .box_w = 4, .box_h = 2, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2116, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2117, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2119, .adv_w = 112, .box_w = 4, .box_h = 3, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 2121, .adv_w = 112, .box_w = 7, .box_h = 1, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2122, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 6},
    {.bitmap_index = 2123, .adv_w = 112, .box_w = 3, .box_h = 1, .ofs_x = 3, .ofs_y = 6},
    {.bitmap_index = 2124, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2126, .adv_w = 112, .box_w = 2, .box_h = 2, .ofs_x = 2, .ofs_y = 5},
    {.bitmap_index = 2127, .adv_w = 112, .box_w = 7, .box_h = 2, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 2129, .adv_w = 112, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 6},
    {.bitmap_index = 2130, .adv_w = 112, .box_w = 6, .box_h = 2, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2132, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2136, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2141, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2145, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2150, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2155, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2159, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2164, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2168, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2172, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2177, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2182, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2187, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2192, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2196, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2201, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2206, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2211, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2216, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2221, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2226, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2231, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2235, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2240, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2244, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2249, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2254, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2258, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2263, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2269, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2274, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2279, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2284, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2288, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2293, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2297, .adv_w = 112, .box_w = 5, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2302, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 3, .ofs_y = 1},
    {.bitmap_index = 2305, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2308, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2314, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2318, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2323, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2326, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2332, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2336, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2340, .adv_w = 112, .box_w = 3, .box_h = 4, .ofs_x = 3, .ofs_y = 1},
    {.bitmap_index = 2342, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2345, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2350, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2354, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2357, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2363, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2366, .adv_w = 112, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2371, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2375, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2379, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2382, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2385, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2388, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2392, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2395, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2399, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2402, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2405, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2410, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2414, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2419, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2424, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2429, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2434, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2438, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2441, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2444, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2448, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2453, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2457, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2461, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2465, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2470, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2477, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2482, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2487, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2492, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2497, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2502, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2507, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2512, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2517, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2521, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2525, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2529, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2533, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2538, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2543, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2547, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2552, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2558, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2564, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2569, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2574, .adv_w = 112, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2581, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2586, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2591, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2595, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2600, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2605, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2609, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2612, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2616, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2619, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2623, .adv_w = 112, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2628, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2631, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2634, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2637, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2640, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2644, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2647, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2650, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2653, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2656, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2659, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2663, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2667, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2670, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2674, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2678, .adv_w = 112, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2684, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2687, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2691, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2694, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2697, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2701, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2704, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2707, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2710, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2713, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2716, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2719, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2723, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2727, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2729, .adv_w = 112, .box_w = 3, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2732, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2735, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2739, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2745, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2750, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2754, .adv_w = 112, .box_w = 4, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2757, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2763, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2767, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2772, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2777, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2781, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2785, .adv_w = 112, .box_w = 4, .box_h = 7, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2789, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2792, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2795, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 2, .ofs_y = 2},
    {.bitmap_index = 2797, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2801, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2804, .adv_w = 112, .box_w = 3, .box_h = 4, .ofs_x = 2, .ofs_y = 2},
    {.bitmap_index = 2806, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2809, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2812, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2816, .adv_w = 112, .box_w = 4, .box_h = 3, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 2818, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2823, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2826, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2831, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2834, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2838, .adv_w = 112, .box_w = 3, .box_h = 5, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2840, .adv_w = 112, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2842, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2845, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2848, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2852, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2855, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2859, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2862, .adv_w = 112, .box_w = 4, .box_h = 5, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2865, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2868, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2871, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 2874, .adv_w = 112, .box_w = 3, .box_h = 5, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2876, .adv_w = 112, .box_w = 1, .box_h = 4, .ofs_x = 3, .ofs_y = 3},
    {.bitmap_index = 2877, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2881, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 2, .ofs_y = 3},
    {.bitmap_index = 2884, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2888, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2892, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2896, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2900, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 3, .ofs_y = 3},
    {.bitmap_index = 2903, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 2, .ofs_y = 3},
    {.bitmap_index = 2906, .adv_w = 112, .box_w = 5, .box_h = 4, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2909, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2913, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2916, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2921, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2924, .adv_w = 112, .box_w = 8, .box_h = 5, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2929, .adv_w = 112, .box_w = 8, .box_h = 5, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2934, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2938, .adv_w = 112, .box_w = 5, .box_h = 6, .ofs_x = 2, .ofs_y = 1},
    {.bitmap_index = 2942, .adv_w = 112, .box_w = 7, .box_h = 1, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2943, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2947, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2953, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 2956, .adv_w = 112, .box_w = 7, .box_h = 6, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 2962, .adv_w = 112, .box_w = 5, .box_h = 5, .ofs_x = 2, .ofs_y = 0},
    {.bitmap_index = 2966, .adv_w = 112, .box_w = 7, .box_h = 4, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 2970, .adv_w = 112, .box_w = 3, .box_h = 3, .ofs_x = 3, .ofs_y = 3},
    {.bitmap_index = 2972, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2975, .adv_w = 112, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 2978, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2983, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2987, .adv_w = 112, .box_w = 6, .box_h = 5, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 2991, .adv_w = 112, .box_w = 6, .box_h = 6, .ofs_x = 1, .ofs_y = 1}
};

/*---------------------
 *  CHARACTER MAPPING
 *--------------------*/

static const uint8_t glyph_id_ofs_list_5[] = {
    0, 1, 2, 3, 0, 0, 0, 0,
    4, 5, 6, 0, 0, 0, 7, 8
};

static const uint16_t unicode_list_7[] = {
    0x0, 0x1, 0x4, 0x5, 0x6, 0x7, 0x8, 0x9,
    0xa, 0xb, 0xc, 0xd, 0x32, 0x33, 0x3d, 0x6c,
    0x6e, 0xa0, 0xa3, 0xa7, 0xb6
};

static const uint8_t glyph_id_ofs_list_8[] = {
    0, 1, 2, 3, 4, 5, 6, 7,
    8, 9, 10, 11, 12, 13, 0, 14,
    15, 16, 0, 17, 18, 19, 20, 21,
    22, 0, 0, 23, 24, 0, 0, 25,
    26, 27, 28, 29, 30, 31, 32, 33,
    34, 35, 0, 36, 37, 0, 38, 0,
    39, 0, 40, 41, 0, 42, 43, 44,
    45, 46, 47, 48, 49, 50, 51, 0,
    52, 53, 54, 55, 56
};

static const uint16_t unicode_list_9[] = {
    0x0, 0x13, 0x37, 0x39, 0x3a, 0x3b, 0x3d, 0x3f,
    0x40
};

static const uint8_t glyph_id_ofs_list_13[] = {
    0, 1, 0, 0, 0, 2, 3, 4,
    5, 6
};

static const uint16_t unicode_list_15[] = {
    0x0, 0x1, 0x2, 0x3, 0x7b, 0x7c, 0x7d, 0x7e,
    0x7f, 0x80, 0x81, 0x82, 0x91, 0x92, 0x9c
};

static const uint8_t glyph_id_ofs_list_17[] = {
    0, 0, 0, 0, 1, 2, 3, 4,
    5, 6, 7, 0, 8, 9, 10, 11,
    12, 13, 14, 0, 15, 16, 17, 18,
    0, 0, 0, 0, 0, 19, 20, 21,
    22, 23, 24, 25, 26, 27, 28, 29
};

/*Collect the unicode lists and glyph_id offsets*/
static const lv_font_fmt_txt_cmap_t cmaps[] =
{
    {
        .range_start = 32, .range_length = 118, .glyph_id_start = 1,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 150, .range_length = 256, .glyph_id_start = 119,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 407, .range_length = 9, .glyph_id_start = 375,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 439, .range_length = 1, .glyph_id_start = 384,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 461, .range_length = 23, .glyph_id_start = 385,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 486, .range_length = 16, .glyph_id_start = 408,
        .unicode_list = NULL, .glyph_id_ofs_list = glyph_id_ofs_list_5, .list_length = 16, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_FULL
    },
    {
        .range_start = 504, .range_length = 36, .glyph_id_start = 417,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 550, .range_length = 183, .glyph_id_start = 453,
        .unicode_list = unicode_list_7, .glyph_id_ofs_list = NULL, .list_length = 21, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY
    },
    {
        .range_start = 768, .range_length = 69, .glyph_id_start = 474,
        .unicode_list = NULL, .glyph_id_ofs_list = glyph_id_ofs_list_8, .list_length = 69, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_FULL
    },
    {
        .range_start = 847, .range_length = 65, .glyph_id_start = 531,
        .unicode_list = unicode_list_9, .glyph_id_ofs_list = NULL, .list_length = 9, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY
    },
    {
        .range_start = 913, .range_length = 17, .glyph_id_start = 540,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 931, .range_length = 13, .glyph_id_start = 557,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 945, .range_length = 30, .glyph_id_start = 570,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 1024, .range_length = 10, .glyph_id_start = 600,
        .unicode_list = NULL, .glyph_id_ofs_list = glyph_id_ofs_list_13, .list_length = 10, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_FULL
    },
    {
        .range_start = 1040, .range_length = 66, .glyph_id_start = 607,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 1109, .range_length = 157, .glyph_id_start = 673,
        .unicode_list = unicode_list_15, .glyph_id_ofs_list = NULL, .list_length = 15, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY
    },
    {
        .range_start = 1488, .range_length = 27, .glyph_id_start = 688,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 1571, .range_length = 40, .glyph_id_start = 715,
        .unicode_list = NULL, .glyph_id_ofs_list = glyph_id_ofs_list_17, .list_length = 40, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_FULL
    },
    {
        .range_start = 1649, .range_length = 3, .glyph_id_start = 745,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    }
};



/*--------------------
 *  ALL CUSTOM DATA
 *--------------------*/

#if LV_VERSION_CHECK(8, 0, 0)
/*Store all the custom data of the font*/
static  lv_font_fmt_txt_glyph_cache_t cache;
static const lv_font_fmt_txt_dsc_t font_dsc = {
#else
static lv_font_fmt_txt_dsc_t font_dsc = {
#endif
    .glyph_bitmap = glyph_bitmap,
    .glyph_dsc = glyph_dsc,
    .cmaps = cmaps,
    .kern_dsc = NULL,
    .kern_scale = 0,
    .cmap_num = 19,
    .bpp = 1,
    .kern_classes = 0,
    .bitmap_format = 0,
#if LV_VERSION_CHECK(8, 0, 0)
    .cache = &cache
#endif
};


/*-----------------
 *  PUBLIC FONT
 *----------------*/

/*Initialize a public general font descriptor*/
#if LV_VERSION_CHECK(8, 0, 0)
const lv_font_t lv_font_unscii_7_thin = {
#else
lv_font_t lv_font_unscii_7_thin = {
#endif
    .get_glyph_dsc = lv_font_get_glyph_dsc_fmt_txt,    /*Function pointer to get glyph's data*/
    .get_glyph_bitmap = lv_font_get_bitmap_fmt_txt,    /*Function pointer to get glyph's bitmap*/
    .line_height = 8,          /*The maximum line height required by the font*/
    .base_line = 0,             /*Baseline measured from the bottom of the line*/
#if !(LVGL_VERSION_MAJOR == 6 && LVGL_VERSION_MINOR == 0)
    .subpx = LV_FONT_SUBPX_NONE,
#endif
#if LV_VERSION_CHECK(7, 4, 0) || LVGL_VERSION_MAJOR >= 8
    .underline_position = 0,
    .underline_thickness = 0,
#endif
    .dsc = &font_dsc           /*The custom font data. Will be accessed by `get_glyph_bitmap/dsc` */
};



#endif /*#if LV_FONT_UNSCII_7_THIN*/

